balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87J10.PIC
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="AD1"/>
      <edc:VirtualPin edc:name="PSP1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="AD0"/>
      <edc:VirtualPin edc:name="PSP0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="AD15"/>
      <edc:VirtualPin edc:name="ECCP2"/>
      <edc:VirtualPin edc:name="P2A"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="AD14"/>
      <edc:VirtualPin edc:name="P1B"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="AD13"/>
      <edc:VirtualPin edc:name="P1C"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="AD12"/>
      <edc:VirtualPin edc:name="P3B"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="AD11"/>
      <edc:VirtualPin edc:name="P3C"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="AD10"/>
      <edc:VirtualPin edc:name="CS"/>
      <edc:VirtualPin edc:name="P2B"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="A16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="A17"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>